#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azdoa_weu.module.azdoa_li_infra.azurerm_linux_virtual_machine_scale_set.this will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "this" {
        id                                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/virtualMachineScaleSets/io-p-azdoa-vmss-li-infra"
      ~ instances                                         = 1 -> 0
        name                                              = "io-p-azdoa-vmss-li-infra"
        tags                                              = {
            "__AzureDevOpsElasticPool"          = "io-prod-linux"
            "__AzureDevOpsElasticPoolTimeStamp" = "3/19/2025 1:41:13 PM"
        }
        # (30 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.vpn_weu.module.dns_forwarder.azurerm_container_group.this must be replaced
-/+ resource "azurerm_container_group" "this" {
      ~ exposed_port                = [
          - {
              - port     = 53
              - protocol = "UDP"
            },
        ] -> (known after apply)
      + fqdn                        = (known after apply)
      ~ id                          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.ContainerInstance/containerGroups/io-p-dns-forwarder" -> (known after apply)
      ~ ip_address                  = "10.0.252.12" -> (known after apply)
        name                        = "io-p-dns-forwarder"
      + network_profile_id          = (known after apply)
      ~ subnet_ids                  = [ # forces replacement
          - "/subscriptions/EC285037-C673-4F58-B594-D7C480DA4E8B/resourceGroups/IO-P-RG-COMMON/providers/Microsoft.Network/virtualNetworks/IO-P-VNET-COMMON/subnets/IO-P-DNSFORWARDER",
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-dnsforwarder",
        ]
        tags                        = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      - zones                       = [] -> null
        # (9 unchanged attributes hidden)

      ~ container {
          - cpu_limit                    = 0 -> null
          - environment_variables        = {} -> null
          - memory_limit                 = 0 -> null
            name                         = "dns-forwarder"
          - secure_environment_variables = (sensitive value) -> null
            # (4 unchanged attributes hidden)

          ~ volume {
                name                 = "dns-forwarder-conf"
              ~ secret               = (sensitive value)
                # (6 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.azdoa_weu.module.azdoa_snet.azurerm_subnet.this,
  on .terraform/modules/azdoa_weu.azdoa_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 11 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
